---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralConnectionHandler
source: html/ed7188b3-d5fc-7396-ec87-829f3fc5e0c9.htm
---
# StructuralConnectionHandler Methods

Adds element ids to the connection.
 All element ids in an array should be of applicable category.